#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-CLINIC-PORTAL.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-LICENCE-STATUS will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-LICENCE-STATUS" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "LICENCE-STATUS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for LICENCE-STATUS"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-CLINIC-PORTAL.keycloak_openid_user_session_note_protocol_mapper.IDP will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "IDP" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "identity_provider"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "IDP"
      + realm_id            = "moh_applications"
      + session_note        = "identity_provider"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "2d866485-09e8-4053-a15e-cd9fef5fd323"
        name                                       = "IVF Portal"
      ~ valid_redirect_uris                        = [
          + "https://bcministryofhealth-ivfportal--ivfuat.sandbox.my.salesforce.com/*",
            # (2 unchanged elements hidden)
        ]
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be updated in-place
  ~ resource "keycloak_group_roles" "GROUP_ROLES" {
        id         = "moh_applications/02182ed8-828f-4937-b770-ec781afaf4b7"
      ~ role_ids   = [
          - "06799768-828d-4299-832b-0cc7a56684b0",
          - "55179234-d6b5-4549-9e21-159bc9800425",
          - "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          - "8bea7469-b2b6-4799-b914-91ee2221a15a",
          - "ae60849e-d126-4678-bd46-838fae1448a7",
          - "b05e8da8-3737-4684-8523-612d902deaa2",
          - "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
          - "cda7bc35-a61c-4822-b0cb-0c45ebe626cc",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-CLINIC-PORTAL.module.client-roles.keycloak_role.ROLES["clinic-admin"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "clinic-admin"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.IVF-PORTAL.module.client-roles.keycloak_role.ROLES["clinic-admin"] will be destroyed
  # (because key ["clinic-admin"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "2d866485-09e8-4053-a15e-cd9fef5fd323" -> null
      - id         = "888366b6-0214-484a-810c-f1478aa0e6cb" -> null
      - name       = "clinic-admin" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-ivf-clinic-portal"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-ivf-clinic-portal"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-ivf-clinic-portal"
      + realm_id  = "moh_applications"
    }

Plan: 10 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*